Revit 2027 API
FormatOptions.GetValidSymbols Method
 Gets the identifiers of all valid symbols for the unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ForgeTypeId> GetValidSymbols()
Public Function GetValidSymbols As IList(Of ForgeTypeId)
public:
IList<ForgeTypeId^>^ GetValidSymbols()
member GetValidSymbols : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 Identifiers of the valid symbols.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
GetValidSymbols Overload
Autodesk.Revit.DB Namespace